// Напишите программу, которая принимает на
// вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

for ( int i = 1; i<10; i++)
{
    Console.WriteLine($"{i}^3 = {i*i*i}");
}